Catalogs/АР_ИсторияИК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>АР_ИсторияИК</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АР17_УстановкаПараметровИК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Изменения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаЗаписи</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НазваниеТабличнойЧасти</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТаблицаИзменений</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/АР_ИсторияИК/Ext/ObjectModule.bsl
//Это основная функция которую будет вызывать для записи изменения
//Фиксируются только новые и измененные строки
//Табличная часть - в эту переменную передаем табличную часть документ
//НазваниеТабличнойЧасти - название табличной части. именно по этому параметру будет искаться предыдущее значение табличной части.
//Объект - объект, в принципе может и не поднадобиться
Процедура ЗафиксироватьИзменения(ТабличнаяЧасть, НазваниеТабличнойЧасти, Объект) Экспорт	
	СтараяТаблица = ПолучитьСтаруюТаблицу(НазваниеТабличнойЧасти); //Получаем старую таблицу 
	НоваяТаблица = ТабличнаяЧасть.Выгрузить();
		
	Если ТипЗнч(СтараяТаблица)=Тип("ТаблицаЗначений") Тогда
		//Если в новой таблице нет строк тогда просто записываем новую таблицу
		Если НоваяТаблица.Количество()=0 и СтараяТаблица.Количество()>0 Тогда
			ЗафиксироватьТаблицу(НоваяТаблица, НазваниеТабличнойЧасти);
		ИначеЕсли НоваяТаблица.Количество()>0 и СтараяТаблица.Количество()>0 Тогда
			//Надо сравнивать	
			Если ЕстьИзмененияВТаблицах(СтараяТаблица, НоваяТаблица) Тогда
				 ЗафиксироватьТаблицу(НоваяТаблица, НазваниеТабличнойЧасти);
			КонецЕсли;
		КонецЕсли;		
	Иначе
		//Сравнивать не надо - это первая фиксация
		//Фиксируем только если в таблице есть строки
		Если НоваяТаблица.Количество()>0 Тогда
			ЗафиксироватьТаблицу(НоваяТаблица, НазваниеТабличнойЧасти);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
 
//Функция получает ТаблицуЗначений - предыдущее значение табличной части
Функция ПолучитьСтаруюТаблицу(НазваниеТабличнойЧасти) Экспорт        
	МассивСтрок = Изменения.НайтиСтроки(Новый Структура("НазваниеТабличнойЧасти", НазваниеТабличнойЧасти));
	Если МассивСтрок.Количество()>0 Тогда
		ТаблицаИзменений = ЗначениеИзСтрокиВнутр(МассивСтрок.Получить(МассивСтрок.Количество()-1).ТаблицаИзменений);
		Возврат ТаблицаИзменений;
	Иначе
		ТаблицаИзменений = Неопределено;
		Возврат ТаблицаИзменений;
	КонецЕсли;	
КонецФункции
 
//Функция сравнивает две строки, которые являются предыдущим и текущим значением ТабличнойЧасти документа
Функция ЕстьИзмененияВТаблицах(СтараяТаблица, НоваяТаблица)
	Если ЗначениеВСтрокуВнутр(СтараяТаблица)=ЗначениеВСтрокуВнутр(НоваяТаблица) Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
КонецФункции
 
//Фиксируем изменения, а именно записываем новую табличную часть документа в элемент справочника "ИсторияИзменений"
Функция ЗафиксироватьТаблицу(ТаблицаИзменений, НазваниеТабличнойЧасти) Экспорт
	НоваяСтрока = Изменения.Добавить();
	НоваяСтрока.ДатаЗаписи = ТекущаяДата();
	НоваяСтрока.НазваниеТабличнойЧасти = НазваниеТабличнойЧасти;
	НоваяСтрока.ТаблицаИзменений = ЗначениеВСтрокуВнутр(ТаблицаИзменений);
	НоваяСтрока.Автор = ПараметрыСеанса.ТекущийПользователь;
	Записать();
КонецФункции
